{
  "title": "Projet - Serveur Mail Personnel (Postfix + Dovecot + Rainloop)",
  "mainTool": {
    "name": "Postfix",
    "avatarUrl": "/icon/Postfix-logo.svg"
  },
  "coverImage": "https://i.postimg.cc/CxkBMFZS/screen-rainloop.png",
  "tags": [
    { "name": "Postfix" },
    { "name": "Dovecot" },
    { "name": "Rainloop" },
    { "name": "PHP" },
    { "name": "MariaDB" },
    { "name": "Linux (Debian)" }
  ],
  "summary": "Un serveur mail personnel auto-hébergé avec Postfix, Dovecot, Rainloop et une interface d'administration PHP.",
  "links": {
    "demo": "",
    "github": "https://github.com/SofianBelbacha/Projet_solution_messagerie"
  },
  "overview": "Ce projet met en place un serveur mail personnel complet auto-hébergé sur une machine Debian. Il s'appuie sur Postfix pour la gestion de l'envoi des mails (SMTP), Dovecot pour la réception (IMAP), et Rainloop comme interface Webmail simple et moderne. Une interface d’administration en PHP permet également de redémarrer les services facilement. La gestion des comptes utilisateurs est assurée via une base de données MariaDB.",
  "features": [
    {
      "title": "Service SMTP avec Postfix",
      "description": "Permet l’envoi d’e-mails avec authentification SMTP sécurisée."
    },
    {
      "title": "Service IMAP avec Dovecot",
      "description": "Permet la réception des e-mails avec accès distant via IMAP."
    },
    {
      "title": "Webmail moderne",
      "description": "Accès aux boîtes mail via Rainloop, interface web légère et rapide."
    },
    {
      "title": "Interface d’administration",
      "description": "Mini dashboard PHP pour redémarrer Postfix et Dovecot."
    },
    {
      "title": "Gestion via MariaDB",
      "description": "Stockage des utilisateurs, mots de passe et domaines dans une base de données MariaDB."
    }
  ],
  "technologies": [
    {
      "name": "Postfix",
      "iconUrl": "/icon/Postfix-logo.svg",
      "description": "Postfix est un agent de transfert de mail (MTA) rapide et sécurisé utilisé pour l’envoi des courriels (SMTP)."
    },
    {
      "name": "Dovecot",
      "iconUrl": "/icon/dovecot.svg",
      "description": "Dovecot est un serveur IMAP léger et sécurisé pour la réception et la consultation des emails."
    },
    {
      "name": "Rainloop",
      "iconUrl": "/icon/email-18-svgrepo-com",
      "description": "Rainloop est un client webmail moderne, rapide et simple à intégrer."
    },
    {
      "name": "MariaDB",
      "iconUrl": "/icon/mariadb.svg",
      "description": "Système de gestion de base de données relationnelle open source, utilisé pour gérer les utilisateurs."
    },
    {
      "name": "PHP",
      "iconUrl": "/icon/php.svg",
      "description": "Langage de script côté serveur utilisé ici pour créer l’interface d’administration web."
    },
    {
      "name": "Linux (Debian)",
      "iconUrl": "/icon/debian.svg",
      "description": "Distribution Linux stable et robuste utilisée pour héberger le serveur de messagerie."
    }
  ],
  "createdAt": "2025-06-15"
}
