{  
  "title": {
    "fr": "Projet - La Maison Jungle",
    "en": "Project - La Maison Jungle"
  },

  "summary": {
    "fr": "Site de vente de plantes d’intérieur réalisé en React dans le cadre d’un exercice fil rouge d’un cours OpenClassrooms, visant à maîtriser les bases du framework.",
    "en": "Indoor plant e-commerce website built with React as a capstone project for an OpenClassrooms course, aimed at mastering the basics of the framework."
  },

  "overview": {
    "fr": "La Maison Jungle est une application web conçue dans le cadre d’un projet pédagogique sur OpenClassrooms. Ce site de vente de plantes a été développé avec React pour apprendre les concepts fondamentaux du framework : composants, props, state, événements, conditionnels, listes et hooks. L'interface simple et agréable met l'accent sur l'interactivité, la modularité du code et la réactivité côté client.",
    "en": "La Maison Jungle is a web application developed as part of an OpenClassrooms educational project. This plant e-commerce site was built with React to learn fundamental framework concepts: components, props, state, events, conditionals, lists, and hooks. The simple and user-friendly interface emphasizes interactivity, code modularity, and client-side responsiveness."
  },

  "mainTool": {
    "name": "React",
    "avatarUrl": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/react/react-original.svg"
  },

  "coverImage": "https://i.postimg.cc/d0wR4Z32/La-maison-jungle.png",

  "tags": [
    { "name": { "fr": "React", "en": "React" } },
    { "name": { "fr": "JavaScript", "en": "JavaScript" } },
    { "typeProject": "Frontend", "name": { "fr": "Frontend", "en": "Frontend" } },
    { "name": { "fr": "SQL", "en": "SQL" } }
  ],

  "features": [
    {
      "title": { "fr": "Catalogue de plantes", "en": "Plant Catalog" },
      "description": { "fr": "Affichage dynamique d’une liste de plantes avec leurs caractéristiques : nom, catégorie, prix, et besoin en lumière/eau.", "en": "Dynamic display of a list of plants with their details: name, category, price, and light/water requirements." }
    },
    {
      "title": { "fr": "Panier interactif", "en": "Interactive Cart" },
      "description": { "fr": "Ajout et suppression de plantes dans un panier fonctionnel stocké dans le state React.", "en": "Add and remove plants in a functional cart stored in React state." }
    },
    {
      "title": { "fr": "Filtres par catégorie", "en": "Category Filters" },
      "description": { "fr": "Navigation facilitée grâce à un filtre permettant de trier les plantes par type (plantes d'intérieur, grasses, etc.).", "en": "Easy navigation using a filter to sort plants by type (indoor, succulent, etc.)." }
    },
    {
      "title": { "fr": "Design responsive", "en": "Responsive Design" },
      "description": { "fr": "Adaptabilité de l'interface aux différents formats d’écran (mobile, tablette, desktop).", "en": "Interface adapts to different screen sizes (mobile, tablet, desktop)." }
    }
  ],

  "technologies": [
    {
      "name": "React",
      "iconUrl": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/react/react-original.svg",
      "description": { "fr": "Framework JavaScript utilisé pour construire l’interface utilisateur de manière réactive à l’aide de composants.", "en": "JavaScript framework used to build a reactive user interface using components." }
    },
    {
      "name": "JavaScript",
      "iconUrl": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/javascript/javascript-original.svg",
      "description": { "fr": "Langage de programmation utilisé pour structurer les interactions et logiques métier.", "en": "Programming language used to structure interactions and business logic." }
    },
    {
      "name": "HTML5",
      "iconUrl": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/html5/html5-original.svg",
      "description": { "fr": "Structure des pages et composants React.", "en": "Structure of pages and React components." }
    },
    {
      "name": "CSS3",
      "iconUrl": "https://cdn.jsdelivr.net/gh/devicons/devicon/icons/css3/css3-original.svg",
      "description": { "fr": "Styles de présentation du site, en complément du rendu React.", "en": "Presentation styles for the site, complementing React rendering." }
    }
  ],

  "links": {
    "demo": "",
    "github": ""
  },

  "createdAt": 1741906800079
}
